### Import

In [1]:
import pandas as pd
print(pd.__version__)

1.3.4

### Persiapan data frame

In [2]:
data = {'nama' : ['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'],
       'tempat_kelahiran' :['Surakata, Jawa Tengah','Jakarta,DKI Jakarta','Mojokerto, Jawa Tengah']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot   Surakata, Jawa Tengah
1  Glenn Fredly     Jakarta,DKI Jakarta
2    Mbah Surip  Mojokerto, Jawa Tengah

### Memecah nama depan dan nama belakang

In [4]:
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot   Surakata, Jawa Tengah       Didi        Kempot
1  Glenn Fredly     Jakarta,DKI Jakarta      Glenn        Fredly
2    Mbah Surip  Mojokerto, Jawa Tengah       Mbah         Surip

### Memecah nama kota dan propinsi

In [5]:
df[['kota','propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakata, Jawa Tengah",Didi,Kempot,Surakata,Jawa Tengah
1,Glenn Fredly,"Jakarta,DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Tengah",Mbah,Surip,Mojokerto,Jawa Tengah